###################################################################

# Created by write_sdc on Wed Feb 17 12:48:27 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[31]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[30]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[29]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[28]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[27]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[26]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[25]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[24]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[23]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[22]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[21]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[20]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[19]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[18]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[17]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[16]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[15]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[14]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[13]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[12]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[11]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[10]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[9]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[8]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[7]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[6]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[5]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[4]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[3]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[2]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[1]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADD[0]}]
set_load -pin_load 3.40189 [get_ports RF_RD1_EN]
set_load -pin_load 3.40189 [get_ports RF_RD2_EN]
set_load -pin_load 3.40189 [get_ports RF_WR_EN]
set_load -pin_load 3.40189 [get_ports {RF_RD1_ADD[4]}]
set_load -pin_load 3.40189 [get_ports {RF_RD1_ADD[3]}]
set_load -pin_load 3.40189 [get_ports {RF_RD1_ADD[2]}]
set_load -pin_load 3.40189 [get_ports {RF_RD1_ADD[1]}]
set_load -pin_load 3.40189 [get_ports {RF_RD1_ADD[0]}]
set_load -pin_load 3.40189 [get_ports {RF_RD2_ADD[4]}]
set_load -pin_load 3.40189 [get_ports {RF_RD2_ADD[3]}]
set_load -pin_load 3.40189 [get_ports {RF_RD2_ADD[2]}]
set_load -pin_load 3.40189 [get_ports {RF_RD2_ADD[1]}]
set_load -pin_load 3.40189 [get_ports {RF_RD2_ADD[0]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_ADD[4]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_ADD[3]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_ADD[2]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_ADD[1]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_ADD[0]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[31]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[30]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[29]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[28]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[27]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[26]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[25]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[24]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[23]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[22]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[21]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[20]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[19]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[18]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[17]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[16]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[15]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[14]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[13]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[12]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[11]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[10]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[9]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[8]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[7]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[6]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[5]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[4]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[3]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[2]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[1]}]
set_load -pin_load 3.40189 [get_ports {RF_WR_DATA[0]}]
set_load -pin_load 3.40189 [get_ports DRAM_WE]
set_load -pin_load 3.40189 [get_ports DRAM_RE]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADD[0]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DIN[0]}]
create_clock [get_ports Clk]  -name clk1  -period 2.3  -waveform {0 1.15}
set_clock_uncertainty 0.07  [get_clocks clk1]
set_max_delay 2.3  -from [list [get_ports Clk] [get_ports Rst] [get_ports {IRAM_DOUT[31]}]       \
[get_ports {IRAM_DOUT[30]}] [get_ports {IRAM_DOUT[29]}] [get_ports             \
{IRAM_DOUT[28]}] [get_ports {IRAM_DOUT[27]}] [get_ports {IRAM_DOUT[26]}]       \
[get_ports {IRAM_DOUT[25]}] [get_ports {IRAM_DOUT[24]}] [get_ports             \
{IRAM_DOUT[23]}] [get_ports {IRAM_DOUT[22]}] [get_ports {IRAM_DOUT[21]}]       \
[get_ports {IRAM_DOUT[20]}] [get_ports {IRAM_DOUT[19]}] [get_ports             \
{IRAM_DOUT[18]}] [get_ports {IRAM_DOUT[17]}] [get_ports {IRAM_DOUT[16]}]       \
[get_ports {IRAM_DOUT[15]}] [get_ports {IRAM_DOUT[14]}] [get_ports             \
{IRAM_DOUT[13]}] [get_ports {IRAM_DOUT[12]}] [get_ports {IRAM_DOUT[11]}]       \
[get_ports {IRAM_DOUT[10]}] [get_ports {IRAM_DOUT[9]}] [get_ports              \
{IRAM_DOUT[8]}] [get_ports {IRAM_DOUT[7]}] [get_ports {IRAM_DOUT[6]}]          \
[get_ports {IRAM_DOUT[5]}] [get_ports {IRAM_DOUT[4]}] [get_ports               \
{IRAM_DOUT[3]}] [get_ports {IRAM_DOUT[2]}] [get_ports {IRAM_DOUT[1]}]          \
[get_ports {IRAM_DOUT[0]}] [get_ports {RF_RD1_DATA[31]}] [get_ports            \
{RF_RD1_DATA[30]}] [get_ports {RF_RD1_DATA[29]}] [get_ports {RF_RD1_DATA[28]}] \
[get_ports {RF_RD1_DATA[27]}] [get_ports {RF_RD1_DATA[26]}] [get_ports         \
{RF_RD1_DATA[25]}] [get_ports {RF_RD1_DATA[24]}] [get_ports {RF_RD1_DATA[23]}] \
[get_ports {RF_RD1_DATA[22]}] [get_ports {RF_RD1_DATA[21]}] [get_ports         \
{RF_RD1_DATA[20]}] [get_ports {RF_RD1_DATA[19]}] [get_ports {RF_RD1_DATA[18]}] \
[get_ports {RF_RD1_DATA[17]}] [get_ports {RF_RD1_DATA[16]}] [get_ports         \
{RF_RD1_DATA[15]}] [get_ports {RF_RD1_DATA[14]}] [get_ports {RF_RD1_DATA[13]}] \
[get_ports {RF_RD1_DATA[12]}] [get_ports {RF_RD1_DATA[11]}] [get_ports         \
{RF_RD1_DATA[10]}] [get_ports {RF_RD1_DATA[9]}] [get_ports {RF_RD1_DATA[8]}]   \
[get_ports {RF_RD1_DATA[7]}] [get_ports {RF_RD1_DATA[6]}] [get_ports           \
{RF_RD1_DATA[5]}] [get_ports {RF_RD1_DATA[4]}] [get_ports {RF_RD1_DATA[3]}]    \
[get_ports {RF_RD1_DATA[2]}] [get_ports {RF_RD1_DATA[1]}] [get_ports           \
{RF_RD1_DATA[0]}] [get_ports {RF_RD2_DATA[31]}] [get_ports {RF_RD2_DATA[30]}]  \
[get_ports {RF_RD2_DATA[29]}] [get_ports {RF_RD2_DATA[28]}] [get_ports         \
{RF_RD2_DATA[27]}] [get_ports {RF_RD2_DATA[26]}] [get_ports {RF_RD2_DATA[25]}] \
[get_ports {RF_RD2_DATA[24]}] [get_ports {RF_RD2_DATA[23]}] [get_ports         \
{RF_RD2_DATA[22]}] [get_ports {RF_RD2_DATA[21]}] [get_ports {RF_RD2_DATA[20]}] \
[get_ports {RF_RD2_DATA[19]}] [get_ports {RF_RD2_DATA[18]}] [get_ports         \
{RF_RD2_DATA[17]}] [get_ports {RF_RD2_DATA[16]}] [get_ports {RF_RD2_DATA[15]}] \
[get_ports {RF_RD2_DATA[14]}] [get_ports {RF_RD2_DATA[13]}] [get_ports         \
{RF_RD2_DATA[12]}] [get_ports {RF_RD2_DATA[11]}] [get_ports {RF_RD2_DATA[10]}] \
[get_ports {RF_RD2_DATA[9]}] [get_ports {RF_RD2_DATA[8]}] [get_ports           \
{RF_RD2_DATA[7]}] [get_ports {RF_RD2_DATA[6]}] [get_ports {RF_RD2_DATA[5]}]    \
[get_ports {RF_RD2_DATA[4]}] [get_ports {RF_RD2_DATA[3]}] [get_ports           \
{RF_RD2_DATA[2]}] [get_ports {RF_RD2_DATA[1]}] [get_ports {RF_RD2_DATA[0]}]    \
[get_ports {DRAM_DOUT[31]}] [get_ports {DRAM_DOUT[30]}] [get_ports             \
{DRAM_DOUT[29]}] [get_ports {DRAM_DOUT[28]}] [get_ports {DRAM_DOUT[27]}]       \
[get_ports {DRAM_DOUT[26]}] [get_ports {DRAM_DOUT[25]}] [get_ports             \
{DRAM_DOUT[24]}] [get_ports {DRAM_DOUT[23]}] [get_ports {DRAM_DOUT[22]}]       \
[get_ports {DRAM_DOUT[21]}] [get_ports {DRAM_DOUT[20]}] [get_ports             \
{DRAM_DOUT[19]}] [get_ports {DRAM_DOUT[18]}] [get_ports {DRAM_DOUT[17]}]       \
[get_ports {DRAM_DOUT[16]}] [get_ports {DRAM_DOUT[15]}] [get_ports             \
{DRAM_DOUT[14]}] [get_ports {DRAM_DOUT[13]}] [get_ports {DRAM_DOUT[12]}]       \
[get_ports {DRAM_DOUT[11]}] [get_ports {DRAM_DOUT[10]}] [get_ports             \
{DRAM_DOUT[9]}] [get_ports {DRAM_DOUT[8]}] [get_ports {DRAM_DOUT[7]}]          \
[get_ports {DRAM_DOUT[6]}] [get_ports {DRAM_DOUT[5]}] [get_ports               \
{DRAM_DOUT[4]}] [get_ports {DRAM_DOUT[3]}] [get_ports {DRAM_DOUT[2]}]          \
[get_ports {DRAM_DOUT[1]}] [get_ports {DRAM_DOUT[0]}]]  -to [list [get_ports {IRAM_ADD[31]}] [get_ports {IRAM_ADD[30]}] [get_ports    \
{IRAM_ADD[29]}] [get_ports {IRAM_ADD[28]}] [get_ports {IRAM_ADD[27]}]          \
[get_ports {IRAM_ADD[26]}] [get_ports {IRAM_ADD[25]}] [get_ports               \
{IRAM_ADD[24]}] [get_ports {IRAM_ADD[23]}] [get_ports {IRAM_ADD[22]}]          \
[get_ports {IRAM_ADD[21]}] [get_ports {IRAM_ADD[20]}] [get_ports               \
{IRAM_ADD[19]}] [get_ports {IRAM_ADD[18]}] [get_ports {IRAM_ADD[17]}]          \
[get_ports {IRAM_ADD[16]}] [get_ports {IRAM_ADD[15]}] [get_ports               \
{IRAM_ADD[14]}] [get_ports {IRAM_ADD[13]}] [get_ports {IRAM_ADD[12]}]          \
[get_ports {IRAM_ADD[11]}] [get_ports {IRAM_ADD[10]}] [get_ports               \
{IRAM_ADD[9]}] [get_ports {IRAM_ADD[8]}] [get_ports {IRAM_ADD[7]}] [get_ports  \
{IRAM_ADD[6]}] [get_ports {IRAM_ADD[5]}] [get_ports {IRAM_ADD[4]}] [get_ports  \
{IRAM_ADD[3]}] [get_ports {IRAM_ADD[2]}] [get_ports {IRAM_ADD[1]}] [get_ports  \
{IRAM_ADD[0]}] [get_ports RF_RD1_EN] [get_ports RF_RD2_EN] [get_ports          \
RF_WR_EN] [get_ports {RF_RD1_ADD[4]}] [get_ports {RF_RD1_ADD[3]}] [get_ports   \
{RF_RD1_ADD[2]}] [get_ports {RF_RD1_ADD[1]}] [get_ports {RF_RD1_ADD[0]}]       \
[get_ports {RF_RD2_ADD[4]}] [get_ports {RF_RD2_ADD[3]}] [get_ports             \
{RF_RD2_ADD[2]}] [get_ports {RF_RD2_ADD[1]}] [get_ports {RF_RD2_ADD[0]}]       \
[get_ports {RF_WR_ADD[4]}] [get_ports {RF_WR_ADD[3]}] [get_ports               \
{RF_WR_ADD[2]}] [get_ports {RF_WR_ADD[1]}] [get_ports {RF_WR_ADD[0]}]          \
[get_ports {RF_WR_DATA[31]}] [get_ports {RF_WR_DATA[30]}] [get_ports           \
{RF_WR_DATA[29]}] [get_ports {RF_WR_DATA[28]}] [get_ports {RF_WR_DATA[27]}]    \
[get_ports {RF_WR_DATA[26]}] [get_ports {RF_WR_DATA[25]}] [get_ports           \
{RF_WR_DATA[24]}] [get_ports {RF_WR_DATA[23]}] [get_ports {RF_WR_DATA[22]}]    \
[get_ports {RF_WR_DATA[21]}] [get_ports {RF_WR_DATA[20]}] [get_ports           \
{RF_WR_DATA[19]}] [get_ports {RF_WR_DATA[18]}] [get_ports {RF_WR_DATA[17]}]    \
[get_ports {RF_WR_DATA[16]}] [get_ports {RF_WR_DATA[15]}] [get_ports           \
{RF_WR_DATA[14]}] [get_ports {RF_WR_DATA[13]}] [get_ports {RF_WR_DATA[12]}]    \
[get_ports {RF_WR_DATA[11]}] [get_ports {RF_WR_DATA[10]}] [get_ports           \
{RF_WR_DATA[9]}] [get_ports {RF_WR_DATA[8]}] [get_ports {RF_WR_DATA[7]}]       \
[get_ports {RF_WR_DATA[6]}] [get_ports {RF_WR_DATA[5]}] [get_ports             \
{RF_WR_DATA[4]}] [get_ports {RF_WR_DATA[3]}] [get_ports {RF_WR_DATA[2]}]       \
[get_ports {RF_WR_DATA[1]}] [get_ports {RF_WR_DATA[0]}] [get_ports DRAM_WE]    \
[get_ports DRAM_RE] [get_ports {DRAM_ADD[31]}] [get_ports {DRAM_ADD[30]}]      \
[get_ports {DRAM_ADD[29]}] [get_ports {DRAM_ADD[28]}] [get_ports               \
{DRAM_ADD[27]}] [get_ports {DRAM_ADD[26]}] [get_ports {DRAM_ADD[25]}]          \
[get_ports {DRAM_ADD[24]}] [get_ports {DRAM_ADD[23]}] [get_ports               \
{DRAM_ADD[22]}] [get_ports {DRAM_ADD[21]}] [get_ports {DRAM_ADD[20]}]          \
[get_ports {DRAM_ADD[19]}] [get_ports {DRAM_ADD[18]}] [get_ports               \
{DRAM_ADD[17]}] [get_ports {DRAM_ADD[16]}] [get_ports {DRAM_ADD[15]}]          \
[get_ports {DRAM_ADD[14]}] [get_ports {DRAM_ADD[13]}] [get_ports               \
{DRAM_ADD[12]}] [get_ports {DRAM_ADD[11]}] [get_ports {DRAM_ADD[10]}]          \
[get_ports {DRAM_ADD[9]}] [get_ports {DRAM_ADD[8]}] [get_ports {DRAM_ADD[7]}]  \
[get_ports {DRAM_ADD[6]}] [get_ports {DRAM_ADD[5]}] [get_ports {DRAM_ADD[4]}]  \
[get_ports {DRAM_ADD[3]}] [get_ports {DRAM_ADD[2]}] [get_ports {DRAM_ADD[1]}]  \
[get_ports {DRAM_ADD[0]}] [get_ports {DRAM_DIN[31]}] [get_ports                \
{DRAM_DIN[30]}] [get_ports {DRAM_DIN[29]}] [get_ports {DRAM_DIN[28]}]          \
[get_ports {DRAM_DIN[27]}] [get_ports {DRAM_DIN[26]}] [get_ports               \
{DRAM_DIN[25]}] [get_ports {DRAM_DIN[24]}] [get_ports {DRAM_DIN[23]}]          \
[get_ports {DRAM_DIN[22]}] [get_ports {DRAM_DIN[21]}] [get_ports               \
{DRAM_DIN[20]}] [get_ports {DRAM_DIN[19]}] [get_ports {DRAM_DIN[18]}]          \
[get_ports {DRAM_DIN[17]}] [get_ports {DRAM_DIN[16]}] [get_ports               \
{DRAM_DIN[15]}] [get_ports {DRAM_DIN[14]}] [get_ports {DRAM_DIN[13]}]          \
[get_ports {DRAM_DIN[12]}] [get_ports {DRAM_DIN[11]}] [get_ports               \
{DRAM_DIN[10]}] [get_ports {DRAM_DIN[9]}] [get_ports {DRAM_DIN[8]}] [get_ports \
{DRAM_DIN[7]}] [get_ports {DRAM_DIN[6]}] [get_ports {DRAM_DIN[5]}] [get_ports  \
{DRAM_DIN[4]}] [get_ports {DRAM_DIN[3]}] [get_ports {DRAM_DIN[2]}] [get_ports  \
{DRAM_DIN[1]}] [get_ports {DRAM_DIN[0]}]]
set_input_delay -clock clk1  -max 0.5  [get_ports Rst]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[31]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[30]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[29]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[28]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[27]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[26]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[25]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[24]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[23]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[22]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[21]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[20]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[19]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[18]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[17]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[16]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[15]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[14]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[13]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[12]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[11]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[10]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[9]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[8]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[7]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[6]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[5]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[4]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[3]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[2]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[1]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {IRAM_DOUT[0]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[31]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[30]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[29]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[28]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[27]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[26]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[25]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[24]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[23]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[22]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[21]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[20]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[19]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[18]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[17]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[16]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[15]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[14]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[13]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[12]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[11]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[10]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[9]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[8]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[7]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[6]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[5]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[4]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[3]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[2]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[1]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_DATA[0]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[31]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[30]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[29]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[28]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[27]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[26]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[25]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[24]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[23]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[22]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[21]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[20]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[19]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[18]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[17]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[16]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[15]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[14]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[13]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[12]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[11]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[10]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[9]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[8]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[7]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[6]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[5]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[4]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[3]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[2]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[1]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_DATA[0]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[31]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[30]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[29]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[28]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[27]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[26]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[25]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[24]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[23]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[22]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[21]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[20]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[19]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[18]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[17]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[16]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[15]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[14]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[13]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[12]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[11]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[10]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[9]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[8]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[7]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[6]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[5]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[4]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[3]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[2]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[1]}]
set_input_delay -clock clk1  -max 0.5  [get_ports {DRAM_DOUT[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[31]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[30]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[29]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[28]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[27]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[26]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[25]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[24]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[23]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[22]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[21]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[20]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[19]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[18]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[17]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[16]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[15]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[14]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[13]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[12]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[11]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[10]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[9]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[8]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[7]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[6]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[5]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {IRAM_ADD[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports RF_RD1_EN]
set_output_delay -clock clk1  -max 0.5  [get_ports RF_RD2_EN]
set_output_delay -clock clk1  -max 0.5  [get_ports RF_WR_EN]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_ADD[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_ADD[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_ADD[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_ADD[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD1_ADD[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_ADD[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_ADD[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_ADD[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_ADD[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_RD2_ADD[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_ADD[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_ADD[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_ADD[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_ADD[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_ADD[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[31]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[30]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[29]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[28]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[27]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[26]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[25]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[24]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[23]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[22]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[21]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[20]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[19]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[18]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[17]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[16]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[15]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[14]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[13]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[12]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[11]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[10]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[9]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[8]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[7]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[6]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[5]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {RF_WR_DATA[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports DRAM_WE]
set_output_delay -clock clk1  -max 0.5  [get_ports DRAM_RE]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[31]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[30]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[29]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[28]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[27]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[26]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[25]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[24]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[23]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[22]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[21]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[20]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[19]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[18]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[17]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[16]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[15]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[14]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[13]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[12]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[11]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[10]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[9]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[8]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[7]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[6]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[5]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_ADD[0]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[31]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[30]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[29]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[28]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[27]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[26]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[25]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[24]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[23]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[22]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[21]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[20]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[19]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[18]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[17]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[16]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[15]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[14]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[13]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[12]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[11]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[10]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[9]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[8]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[7]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[6]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[5]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[4]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[3]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[2]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[1]}]
set_output_delay -clock clk1  -max 0.5  [get_ports {DRAM_DIN[0]}]
